app/Controllers/AssetsHistory.php

        }

        $minorCategoryModel = new MinorCategoryModel();
        $categories = $minorCategoryModel->select('minor_category.*, major_category.name AS major_category_name')
            ->join('major_category', 'major_category.id = minor_category.major_category_id', 'left')
            ->findAll();

        $usageStatusModel = new UsageStatusModel();
        $usageStatuses = $usageStatusModel->findAll();
---
SELECT `minor_category`.*, `major_category`.`name` AS `major_category_name`
FROM `minor_category`
LEFT JOIN `major_category` ON `major_category`.`id` = `minor_category`.`major_category_id`
SELECT *
FROM `usage_status`