app/Controllers/AssetsController.php

        }

        $minorCategoryModel = new \App\Models\MinorCategoryModel();
        $categories = $minorCategoryModel->select('minor_category.*, major_category.name AS major_category_name')
            ->join('major_category', 'major_category.id = minor_category.major_category_id', 'left')
            ->findAll();

        $stats = $this->getWarehouseStats();
        $statuses = (new \App\Models\OrderStatusModel())->findAll();
        $usageStatuses = (new \App\Models\UsageStatusModel())->findAll();
---
SELECT `minor_category`.*, `major_category`.`name` AS `major_category_name`
FROM `minor_category`
LEFT JOIN `major_category` ON `major_category`.`id` = `minor_category`.`major_category_id`
SELECT *
FROM `order_status`
SELECT *
FROM `usage_status`

    private function getWarehouseStats(): array
    {
        $totalQuantityResult = $this->itemOrderModel->selectSum('quantity')->first();
        $totalReceipts = $totalQuantityResult ? (int)$totalQuantityResult->quantity : 0;
        $availableItems = $this->itemOrderModel->countAllResults();
        $totalEntries = $this->itemModel->countAllResults();
        $lowStock = $this->itemOrderModel->where('quantity <', 10)->where('quantity >', 0)->countAllResults();
        $topCategoryResult = $this->itemOrderModel->select('items.minor_category_id, minor_category.name, COUNT(*) as count')
            ->join('items', 'items.id = item_order.item_id')
            ->join('minor_category', 'minor_category.id = items.minor_category_id', 'left')
            ->groupBy('items.minor_category_id')
            ->orderBy('count', 'ASC')
            ->first();
        $topCategory = $topCategoryResult ? $topCategoryResult->name : 'غير محدد';
        $lastEntry = $this->itemOrderModel->select('item_order.created_at, items.name')
            ->join('items', 'items.id = item_order.item_id', 'left')
            ->orderBy('item_order.created_at', 'ASC')
            ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `items`
SELECT SUM(`quantity`) AS `quantity`
FROM `item_order`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `item_order`
SELECT COUNT(*) AS `numrows`
FROM `item_order`
WHERE `quantity` < 10
AND `quantity` > 0
SELECT `items`.`minor_category_id`, `minor_category`.`name`, COUNT(*) as count
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
GROUP BY `items`.`minor_category_id`
ORDER BY `count` ASC
 LIMIT 1
SELECT `item_order`.`created_at`, `items`.`name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
ORDER BY `item_order`.`created_at` ASC
 LIMIT 1

    public function orderDetails($id)
    {
        $orderModel         = new \App\Models\OrderModel();
        $itemOrderModel     = new \App\Models\ItemOrderModel();
        $userModel          = new \App\Models\UserModel();
        $itemModel          = new \App\Models\ItemModel();
        $minorCatModel      = new \App\Models\MinorCategoryModel();
        $majorCatModel      = new \App\Models\MajorCategoryModel();
        $roomModel          = new \App\Models\RoomModel();
        $usageStatusModel   = new \App\Models\UsageStatusModel();
        $employeeModel      = new \App\Models\EmployeeModel();
        $statusModel        = new \App\Models\OrderStatusModel();

        $order = $orderModel->find($id);

        if (!$order) {
            return redirect()->back()->with('error', 'الطلب غير موجود');
        }

        $fromUser = $userModel->where('user_id', $order->from_user_id)->first();
        $toUser   = $userModel->where('user_id', $order->to_user_id)->first();
        $status   = $statusModel->find($order->order_status_id);

        $order->from_name    = $fromUser->name ?? 'غير معروف';
        $order->to_name      = $toUser->name ?? 'غير معروف';
        $order->status_name  = $status->status ?? 'غير معروف';

        $items = $itemOrderModel
                    ->where('order_id', $id)
                    ->where('usage_status_id !=', 2)
                    ->findAll();

        foreach ($items as $item) {
            $itemData = $itemModel->find($item->item_id);
            $minor    = $itemData ? $minorCatModel->find($itemData->minor_category_id) : null;
            $major    = $minor ? $majorCatModel->find($minor->major_category_id) : null;
---
SELECT *
FROM `order`
WHERE `order`.`order_id` = '30'
SELECT *
FROM `users`
WHERE `user_id` = 'U104'
 LIMIT 1
SELECT *
FROM `users`
WHERE `user_id` = 'U101'
 LIMIT 1
SELECT *
FROM `item_order`
WHERE `order_id` = '3'
SELECT *
FROM `order_status`
WHERE `order_status`.`id` = '1'
SELECT *
FROM `item_order`
WHERE `order_id` = '30'
AND `usage_status_id` != 2
SELECT *
FROM `items`
WHERE `items`.`id` = '17'
SELECT *
FROM `minor_category`
WHERE `minor_category`.`id` = '1'
SELECT *
FROM `major_category`
WHERE `major_category`.`id` = '6'

            $item->minor_category_name  = $minor->name ?? 'غير معروف';
            $item->major_category_name  = $major->name ?? 'غير معروف';
            $item->location_code        = $roomModel->getFullLocationCode($item->room_id);
            $item->usage_status_name    = $usageStatusModel->find($item->usage_status_id)->usage_status ?? 'غير معروف';
            $item->created_by_name      = $employeeModel->where('emp_id', $item->created_by)->first()->name ?? 'غير معروف';
---
SELECT *
FROM `usage_status`
WHERE `usage_status`.`id` = '1'
SELECT *
FROM `employee`
WHERE `emp_id` = '1005'
 LIMIT 1

    public function transferView($orderId)
{
    if (!session()->get('isLoggedIn')) {
        throw new \CodeIgniter\Shield\Exceptions\AuthenticationException();
    }

    $itemOrderModel = new \App\Models\ItemOrderModel();
    $itemModel = new \App\Models\ItemModel();
    $minorCatModel = new \App\Models\MinorCategoryModel();
    $majorCatModel = new \App\Models\MajorCategoryModel();
    $usageStatusModel = new \App\Models\UsageStatusModel();
    $userModel = new \App\Models\UserModel();


    // جلب الأصول المرتبطة بالطلب والتي ليست مرجعة
    $items = $itemOrderModel
        ->where('order_id', $orderId)
        ->where('usage_status_id !=', 2) // ليست مرجعة
        ->findAll();

    foreach ($items as $item) {
        $itemData = $itemModel->find($item->item_id);
        $minor = $itemData ? $minorCatModel->find($itemData->minor_category_id) : null;
        $major = $minor ? $majorCatModel->find($minor->major_category_id) : null;
---
SELECT *
FROM `item_order`
WHERE `order_id` = '2'
AND `usage_status_id` != 2
SELECT *
FROM `items`
WHERE `items`.`id` = '10'
SELECT *
FROM `minor_category`
WHERE `minor_category`.`id` = '6'
SELECT *
FROM `major_category`
WHERE `major_category`.`id` = '1'

        $item->model_num = $itemData->model_num ?? '';
        $item->serial_num = $itemData->serial_num ?? '';
        $item->asset_num = $itemData->asset_num ?? '';
        $item->usage_status_name = $usageStatusModel->find($item->usage_status_id)->usage_status ?? 'غير معروف';
    }

    // جلب جميع المستخدمين
    $users = $userModel->findAll();
---
SELECT *
FROM `usage_status`
WHERE `usage_status`.`id` = '1'
SELECT *
FROM `users`


        // Get user details for email
        $fromUser = $userModel->where('user_id', $fromUserId)->first();
        $toUser = $userModel->where('user_id', $toUserId)->first();
---
SELECT *
FROM `users`
WHERE `user_id` = 'U101'
 LIMIT 1

            'updated_at' => date('Y-m-d H:i:s')
        ];

        $newOrderId = $orderModel->insert($orderData);
---
INSERT INTO `order` (`from_user_id`, `to_user_id`, `order_status_id`, `created_at`, `updated_at`) VALUES ('U101', 'U105', 1, '2025-10-05 13:40:16', '2025-10-05 13:40:16')


        // معالجة كل أصل محدد
        foreach ($itemOrderIds as $itemOrderId) {
            $currentItem = $itemOrderModel
                ->select('item_order.*, items.name as item_name')
                ->join('items', 'items.id = item_order.item_id')
                ->find($itemOrderId);
---
SELECT `item_order`.*, `items`.`name` as `item_name`
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
WHERE `item_order`.`item_order_id` = '2'

                'note' => $note
            ];

            $transferItemsModel->insert($transferData);
---
INSERT INTO `transfer_items` (`item_order_id`, `from_user_id`, `to_user_id`, `order_status_id`, `note`, `created_at`, `updated_at`) VALUES ('2', 'U101', 'U105', 1, '', '2025-10-05 13:40:16', '2025-10-05 13:40:16')