app/Controllers/InventoryController.php

SELECT DISTINCT `item_order`.`order_id`, `item_order`.`created_at`, `item_order`.`created_by`, `item_order`.`room_id`, `employee`.`name` AS `created_by_name`, `employee`.`emp_id` AS `employee_id`, `employee`.`emp_ext` AS `extension`
FROM `item_order`
LEFT JOIN `employee` ON `employee`.`emp_id` = `item_order`.`created_by`
GROUP BY `item_order`.`order_id`
ORDER BY `item_order`.`created_at` DESC
SELECT `minor_category`.*, `major_category`.`name` AS `major_category_name`
FROM `minor_category`
LEFT JOIN `major_category` ON `major_category`.`id` = `minor_category`.`major_category_id`
---
    public function index()
    {
        // exception handling
        if (! session()->get('isLoggedIn')) {
            throw new AuthenticationException();
        }

        $itemOrderModel = new \App\Models\ItemOrderModel();

        $itemOrders = $itemOrderModel
            ->distinct()
            ->select(
                'item_order.order_id,
             item_order.created_at,
             item_order.created_by,
             room.code AS room_code,
             employee.name AS created_by_name,
             employee.emp_id AS employee_id,
             employee.emp_ext AS extension'
            )
            ->join('employee', 'employee.emp_id = item_order.created_by', 'left')
            ->join('room', 'room.id = item_order.room_id', 'left')
            ->groupBy('item_order.order_id') // Prevent duplicate rows
            ->orderBy('item_order.created_at', 'DESC')
            ->findAll();

        // Other data
        $minorCategoryModel = new \App\Models\MinorCategoryModel();
        $categories = $minorCategoryModel->select('minor_category.*, major_category.name AS major_category_name')
            ->join('major_category', 'major_category.id = minor_category.major_category_id', 'left')
            ->findAll();

SELECT *
FROM `order_status`
SELECT *
FROM `usage_status`
---
        $stats = $this->getWarehouseStats();

        $orderStatusModel = new \App\Models\OrderStatusModel();
        $statuses = $orderStatusModel->findAll();

        $usageStatusModel = new \App\Models\UsageStatusModel();
        $usageStatuses = $usageStatusModel->findAll();

SELECT `item_order`.*, `items`.`name` as `item_name`
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
WHERE `order_id` = '1'
SELECT *
FROM `order`
WHERE `order_id` = '1'
 LIMIT 1
---
    public function editOrder($orderId)
    {
        if (!$orderId) {
            return redirect()->back()->with('error', 'رقم الطلب غير محدد.');
        }

        $order = $this->orderModel->find($orderId);
        if (!$order) {
            return redirect()->back()->with('error', 'الطلب غير موجود.');
        }

        $orderItems = $this->itemOrderModel
            ->select('item_order.*, items.name as item_name')
            ->join('items', 'items.id = item_order.item_id')
            ->where('order_id', $orderId)
            ->findAll();

        // من وجود الموظفين
        $fromEmployee = $this->employeeModel->find($order->from_employee_id);
        $toEmployee = $this->employeeModel->find($order->to_employee_id);

        // جلب جميع المباني من قاعدة البيانات
        $buildings = $this->buildingModel->findAll();

        // جلب معلومات الموقع
        $locationInfo = null;
        if (!empty($orderItems[0])) {
            $itemOrder = $orderItems[0];
            $room = $this->roomModel->find($itemOrder->room_id);
            if ($room) {
                $section = $this->sectionModel->find($room->section_id);

SELECT SUM(`quantity`) AS `quantity`
FROM `item_order`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `item_order`
SELECT COUNT(*) AS `numrows`
FROM `items`
SELECT COUNT(*) AS `numrows`
FROM `item_order`
WHERE `quantity` < 10
AND `quantity` > 0
SELECT `items`.`minor_category_id`, `minor_category`.`name`, COUNT(*) as count
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
GROUP BY `items`.`minor_category_id`
ORDER BY `count` ASC
 LIMIT 1
SELECT `item_order`.`created_at`, `items`.`name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
ORDER BY `item_order`.`created_at` ASC
 LIMIT 1
---
    private function getWarehouseStats(): array
    {
        $totalQuantityResult = $this->itemOrderModel->selectSum('quantity')->first();
        $totalReceipts = $totalQuantityResult ? (int)$totalQuantityResult->quantity : 0;
        $availableItems = $this->itemOrderModel->countAllResults();
        $totalEntries = $this->itemModel->countAllResults();
        $lowStock = $this->itemOrderModel->where('quantity <', 10)->where('quantity >', 0)->countAllResults();
        $topCategoryResult = $this->itemOrderModel->select('items.minor_category_id, minor_category.name, COUNT(*) as count')
            ->join('items', 'items.id = item_order.item_id')
            ->join('minor_category', 'minor_category.id = items.minor_category_id', 'left')
            ->groupBy('items.minor_category_id')
            ->orderBy('count', 'ASC')
            ->first();
        $topCategory = $topCategoryResult ? $topCategoryResult->name : 'غير محدد';
        $lastEntry = $this->itemOrderModel->select('item_order.created_at, items.name')
            ->join('items', 'items.id = item_order.item_id', 'left')
            ->orderBy('item_order.created_at', 'ASC')
            ->first();

SELECT *
FROM `building`
SELECT *
FROM `major_category`
SELECT DISTINCT `emp_dept`
FROM `employee`
---
    public function getformdata()
    {
        try {
            $buildings = $this->buildingModel->findAll();
            $categories = $this->majorCategoryModel->findAll();
            $employees = $this->employeeModel->select('emp_dept')->distinct()->findAll();

SELECT `item_order`.*, `items`.`name` AS `item_name`, `minor_category`.`name` AS `minor_category_name`, `major_category`.`name` AS `major_category_name`, `room`.`code` AS `room_code`, `usage_status`.`usage_status` AS `usage_status_name`, `creator`.`name` AS `created_by_name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
LEFT JOIN `major_category` ON `major_category`.`id` = `minor_category`.`major_category_id`
LEFT JOIN `room` ON `room`.`id` = `item_order`.`room_id`
LEFT JOIN `usage_status` ON `usage_status`.`id` = `item_order`.`usage_status_id`
LEFT JOIN `employee` as `creator` ON `creator`.`emp_id` = `item_order`.`created_by`
WHERE `item_order`.`order_id` = '11'
---
    private function validateItemUniqueness($assetNum, $serialNum, $ignoreId = null)
    {
        // التحقق من رقم الأصول
        $assetQuery = $this->itemOrderModel->where('asset_num', $assetNum);
        if ($ignoreId) {
            $assetQuery->where('item_order_id !=', $ignoreId);
        }
        $existingAsset = $assetQuery->first();

SELECT *
FROM `users`
WHERE `user_id` = 'U104'
 LIMIT 1
SELECT *
FROM `order_status`
WHERE `order_status`.`id` = '1'
SELECT *
FROM `order`
WHERE `order`.`order_id` = '41'
SELECT *
FROM `item_order`
WHERE `order_id` = '41'
SELECT *
FROM `items`
WHERE `items`.`id` = '14'
SELECT *
FROM `major_category`
WHERE `major_category`.`id` = '1'
SELECT *
FROM `minor_category`
WHERE `minor_category`.`id` = '5'
---
public function showOrder($id)
{
    $orderModel         = new \App\Models\OrderModel();
    $itemOrderModel     = new \App\Models\ItemOrderModel();
    $userModel          = new \App\Models\UserModel();
    $itemModel          = new \App\Models\ItemModel();
    $minorCatModel      = new \App\Models\MinorCategoryModel();
    $majorCatModel      = new \App\Models\MajorCategoryModel();
    $roomModel          = new \App\Models\RoomModel();
    $usageStatusModel   = new \App\Models\UsageStatusModel();
    $employeeModel      = new \App\Models\EmployeeModel();
    $statusModel        = new \App\Models\OrderStatusModel();


    $order = $orderModel->find($id);

    if (!$order) {
        return redirect()->back()->with('error', 'الطلب غير موجود');
    }


    $fromUser = $userModel->where('user_id', $order->from_user_id)->first();
    $toUser   = $userModel->where('user_id', $order->to_user_id)->first();
    $status   = $statusModel->find($order->order_status_id);

    $order->from_name    = $fromUser->name ?? 'غير معروف';
    $order->to_name      = $toUser->name ?? 'غير معروف';
    $order->status_name  = $status->status ?? 'غير معروف';


    $items = $itemOrderModel->where('order_id', $id)->findAll();

    foreach ($items as $item) {
        $itemData = $itemModel->find($item->item_id);
        $minor    = $itemData ? $minorCatModel->find($itemData->minor_category_id) : null;
        $major    = $minor ? $majorCatModel->find($minor->major_category_id) : null;

SELECT *
FROM `usage_status`
WHERE `usage_status`.`id` = '2'
SELECT *
FROM `employee`
WHERE `emp_id` = '1005'
 LIMIT 1
---
        $item->minor_category_name  = $minor->name ?? 'غير معروف';
        $item->major_category_name  = $major->name ?? 'غير معروف';
        $item->room_code            = $roomModel->find($item->room_id)->code ?? 'غير معروف';
        $item->usage_status_name    = $usageStatusModel->find($item->usage_status_id)->usage_status ?? 'غير معروف';
        $item->created_by_name      = $employeeModel->where('emp_id', $item->created_by)->first()->name ?? 'غير معروف';

SELECT *
FROM `item_order`
WHERE `order_id` = '3'
SELECT *
FROM `order`
WHERE `order`.`order_id` = '3'
---
        $itemsCount = $this->itemOrderModel->where('order_id', $orderId)->countAllResults();

        // حذف الطلب (سيحذف العناصر تلقائياً بسبب CASCADE في قاعدة البيانات)
        $deleteResult = $this->orderModel->delete($orderId);