app/Controllers/login.php

SELECT *
FROM `employee`
WHERE `emp_id` = 'EMP001'
 LIMIT 1
SELECT *
FROM `permission`
WHERE `emp_id` = 'EMP001'
 LIMIT 1
SELECT *
FROM `role`
WHERE `role`.`id` = '1'
---
    public function login()
    {

        $empID = $this->request->getPost('emp_id');
        $password = $this->request->getPost('password');

        $employeeModel = new EmployeeModel();
        $employee = $employeeModel->where('emp_id', $empID)->first();

        if (!$employee || !password_verify($password, $employee->password)) {
            return redirect()->back()->with('error', 'Invalid credentials');
        }

        $permissionModel = new PermissionModel();
        $roleModel = new RoleModel();

        $permission = $permissionModel->where('emp_id', $employee->emp_id)->first();

        if (!$permission || empty($permission->role_id)) {
            return redirect()->back()->with('error', 'No role assigned or invalid permission data');
        }

        $role = $roleModel->find($permission->role_id);