app/Controllers/OrderController.php

    public function searchuser()
    {
        try {
            $userId = $this->request->getGet('user_id');

            log_message('info', 'User search started for: ' . $userId);

            if (empty($userId)) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'يجب إدخال رقم المستخدم'
                ]);
            }

            $user = $this->userModel->where('user_id', $userId)->first();
---
SELECT *
FROM `users`
WHERE `user_id` = 'u101'
 LIMIT 1

    public function getformdata()
    {
        try {
            $buildings = $this->buildingModel->findAll();
            $users = $this->userModel->select('user_dept')->distinct()->findAll();
---
SELECT *
FROM `building`
SELECT DISTINCT `user_dept`
FROM `users`

    public function getfloorsbybuilding($buildingId = null)
    {
        try {
            if (!$buildingId) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'رقم المبنى مطلوب',
                    'data' => []
                ]);
            }

            $floors = $this->floorModel->where('building_id', $buildingId)->findAll();
---
SELECT *
FROM `floor`
WHERE `building_id` = '1'

    public function getsectionsbyfloor($floorId = null)
    {
        try {
            if (!$floorId) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'رقم الطابق مطلوب',
                    'data' => []
                ]);
            }

            $sections = $this->sectionModel->where('floor_id', $floorId)->findAll();
---
SELECT *
FROM `section`
WHERE `floor_id` = '1'

public function getOrderData($orderId = null)
{
    try {
        if (!$orderId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'رقم الطلب مطلوب'
            ]);
        }

        // جلب بيانات الطلب كمصفوفة
        $this->orderModel->asArray();
        $order = $this->orderModel->find($orderId);

        log_message('info', 'Order data: ' . print_r($order, true));

        if (!$order) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'الطلب غير موجود'
            ]);
        }

        // جلب بيانات المرسل كمصفوفة
        $fromUser = null;
        if (isset($order['from_user_id']) && $order['from_user_id']) {
            $this->userModel->asArray();
            $fromUser = $this->userModel->where('user_id', $order['from_user_id'])->first();
---
SELECT *
FROM `order`
WHERE `order`.`order_id` = '9'
SELECT *
FROM `users`
WHERE `user_id` = 'U101'
 LIMIT 1

        $toUser = null;
        if (isset($order['to_user_id']) && $order['to_user_id']) {
            $this->userModel->asArray();
            $toUser = $this->userModel->where('user_id', $order['to_user_id'])->first();
---
SELECT *
FROM `users`
WHERE `user_id` = 'U102'
 LIMIT 1


        // جلب عناصر الطلب - استخدم order_id بدلاً من id
        $builder = $this->itemOrderModel->builder();
        $orderItems = $builder
            ->select('item_order.*, items.name as item_name, room.id as room_id, room.code as room_code,
                     section.id as section_id, floor.id as floor_id, building.id as building_id')
            ->join('items', 'item_order.item_id = items.id', 'left')
            ->join('room', 'item_order.room_id = room.id', 'left')
            ->join('section', 'room.section_id = section.id', 'left')
            ->join('floor', 'section.floor_id = floor.id', 'left')
            ->join('building', 'floor.building_id = building.id', 'left')
            ->where('item_order.order_id', $order['order_id'])  // استخدم order_id هنا
            ->get()
            ->getResultArray();
---
SELECT `item_order`.*, `items`.`name` as `item_name`, `room`.`id` as `room_id`, `room`.`code` as `room_code`, `section`.`id` as `section_id`, `floor`.`id` as `floor_id`, `building`.`id` as `building_id`
FROM `item_order`
LEFT JOIN `items` ON `item_order`.`item_id` = `items`.`id`
LEFT JOIN `room` ON `item_order`.`room_id` = `room`.`id`
LEFT JOIN `section` ON `room`.`section_id` = `section`.`id`
LEFT JOIN `floor` ON `section`.`floor_id` = `floor`.`id`
LEFT JOIN `building` ON `floor`.`building_id` = `building`.`id`
WHERE `item_order`.`order_id` = '9'