app/Controllers/OrderController.php

    public function validateAssetSerial()
    {
        try {
            $assetNum = trim($this->request->getPost('asset_num'));
            $serialNum = trim($this->request->getPost('serial_num'));
            $checkType = $this->request->getPost('check_type');

            if (empty($assetNum) && empty($serialNum)) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'يجب إدخال رقم الأصول أو الرقم التسلسلي'
                ]);
            }

            $errors = [];

            // التحقق من رقم الأصول
            if (!empty($assetNum) && ($checkType === 'asset' || $checkType === 'both')) {
                // التحقق من صحة تنسيق رقم الأصول أولاً
                $assetValidation = $this->validateAssetNumber($assetNum);

                if (!$assetValidation['valid']) {
                    $errors[] = [
                        'type' => 'asset',
                        'message' => $assetValidation['message']
                    ];
                } else {
                    // التحقق من التكرار في قاعدة البيانات
                    $existingAsset = $this->itemOrderModel->where('asset_num', $assetNum)->first();
---
SELECT *
FROM `item_order`
WHERE `asset_num` = '111222222222'
 LIMIT 1