app/Controllers/UserController.php

        $transferItemsModel = new TransferItemsModel();

        // استعلام الطلبات المحولة للمستخدم الحالي
        $myOrders = $transferItemsModel
            ->distinct()
            ->select(
                'transfer_items.transfer_item_id,
                 transfer_items.created_at,
                 transfer_items.item_order_id,
                 transfer_items.is_opened,
                 item_order.created_by AS employee_id,
                 item_order.asset_num,
                 item_order.serial_num,
                 from_user.name AS from_user_name,
                 from_user.user_dept AS from_user_dept,
                 usage_status.usage_status AS usage_status_name,
                 order_status.status AS order_status_name'
            )
            ->join('item_order', 'item_order.item_order_id = transfer_items.item_order_id', 'left')
            ->join('users AS from_user', 'from_user.user_id = transfer_items.from_user_id', 'left')
            ->join('usage_status', 'usage_status.id = item_order.usage_status_id', 'left')
            ->join('order_status', 'order_status.id = transfer_items.order_status_id', 'left')
            ->where('transfer_items.to_user_id', $currentUserId)
            ->orderBy('transfer_items.created_at', 'DESC')
            ->findAll();
---
SELECT DISTINCT `transfer_items`.`transfer_item_id`, `transfer_items`.`created_at`, `transfer_items`.`item_order_id`, `item_order`.`created_by` AS `employee_id`, `item_order`.`asset_num`, `item_order`.`serial_num`, `from_user`.`name` AS `from_user_name`, `from_user`.`user_dept` AS `from_user_dept`, `usage_status`.`usage_status` AS `usage_status_name`, `order_status`.`status` AS `order_status_name`
FROM `transfer_items`
LEFT JOIN `item_order` ON `item_order`.`item_order_id` = `transfer_items`.`item_order_id`
LEFT JOIN `users` AS `from_user` ON `from_user`.`user_id` = `transfer_items`.`from_user_id`
LEFT JOIN `usage_status` ON `usage_status`.`id` = `item_order`.`usage_status_id`
LEFT JOIN `order_status` ON `order_status`.`id` = `transfer_items`.`order_status_id`
WHERE `transfer_items`.`to_user_id` = 'U101'
ORDER BY `transfer_items`.`created_at` DESC

    private function getWarehouseStats(): array
    {
        $itemOrderModel = new ItemOrderModel();
        $itemModel = new ItemModel();

        $totalQuantityResult = $itemOrderModel->selectSum('quantity')->first();
        $totalReceipts = $totalQuantityResult ? (int)$totalQuantityResult->quantity : 0;

        $availableItems = $itemOrderModel->countAllResults();
        $totalEntries = $itemModel->countAllResults();

        $lowStock = $itemOrderModel->where('quantity <', 10)
            ->where('quantity >', 0)
            ->countAllResults();

        $topCategoryResult = $itemOrderModel->select('items.minor_category_id, minor_category.name, COUNT(*) as count')
            ->join('items', 'items.id = item_order.item_id')
            ->join('minor_category', 'minor_category.id = items.minor_category_id', 'left')
            ->groupBy('items.minor_category_id')
            ->orderBy('count', 'DESC')
            ->first();
        $topCategory = $topCategoryResult ? $topCategoryResult->name : 'غير محدد';

        $lastEntry = $itemOrderModel->select('item_order.created_at, items.name')
            ->join('items', 'items.id = item_order.item_id', 'left')
            ->orderBy('item_order.created_at', 'DESC')
            ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `item_order`
WHERE `quantity` < 10
AND `quantity` > 0
SELECT COUNT(*) AS `numrows`
FROM `items`
SELECT `items`.`minor_category_id`, `minor_category`.`name`, COUNT(*) as count
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
GROUP BY `items`.`minor_category_id`
ORDER BY `count` DESC
 LIMIT 1
SELECT `item_order`.`created_at`, `items`.`name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
ORDER BY `item_order`.`created_at` DESC
 LIMIT 1

public function getTransferDetails($transferId)
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'يجب تسجيل الدخول أولاً'
            ]);
        }

        $transferModel = new TransferItemsModel();

        $transfer = $transferModel
            ->select(
                'transfer_items.*,
                 item_order.item_id,
                 item_order.brand,
                 item_order.model_num,
                 item_order.asset_num,
                 item_order.serial_num,
                 item_order.quantity,
                 item_order.note as item_note,
                 items.name as item_name,
                 from_user.name AS from_user_name,
                 from_user.user_dept AS from_user_dept,
                 from_user.user_ext AS from_user_ext,
                 from_user.email AS from_user_email,
                 usage_status.usage_status AS usage_status_name,
                 order_status.status AS order_status_name'
            )
            ->join('item_order', 'item_order.item_order_id = transfer_items.item_order_id', 'left')
            ->join('items', 'items.id = item_order.item_id', 'left')
            ->join('users AS from_user', 'from_user.user_id = transfer_items.from_user_id', 'left')
            ->join('usage_status', 'usage_status.id = item_order.usage_status_id', 'left')
            ->join('order_status', 'order_status.id = transfer_items.order_status_id', 'left')
            ->where('transfer_items.transfer_item_id', $transferId)
            ->first();
---
SELECT `transfer_items`.*, `item_order`.`item_id`, `item_order`.`brand`, `item_order`.`model_num`, `item_order`.`asset_num`, `item_order`.`serial_num`, `item_order`.`quantity`, `item_order`.`note` as `item_note`, `items`.`name` as `item_name`, `from_user`.`name` AS `from_user_name`, `from_user`.`user_dept` AS `from_user_dept`, `from_user`.`user_ext` AS `from_user_ext`, `from_user`.`email` AS `from_user_email`, `usage_status`.`usage_status` AS `usage_status_name`, `order_status`.`status` AS `order_status_name`
FROM `transfer_items`
LEFT JOIN `item_order` ON `item_order`.`item_order_id` = `transfer_items`.`item_order_id`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `users` AS `from_user` ON `from_user`.`user_id` = `transfer_items`.`from_user_id`
LEFT JOIN `usage_status` ON `usage_status`.`id` = `item_order`.`usage_status_id`
LEFT JOIN `order_status` ON `order_status`.`id` = `transfer_items`.`order_status_id`
WHERE `transfer_items`.`transfer_item_id` = '1'
 LIMIT 1