app/Controllers/warehouse.php

    private function getWarehouseStats(): array
    {
        $itemOrderModel = new \App\Models\ItemOrderModel();
        $itemModel = new ItemModel();

        // 1. إجمالي الكميات المستلمة
        $totalQuantityResult = $itemOrderModel->selectSum('quantity')->first();
        $totalReceipts = $totalQuantityResult ? (int)$totalQuantityResult->quantity : 0;

        // 2. عدد الأصناف المتوفرة
        $availableItems = $itemOrderModel->countAllResults();

        // 3. إجمالي الإدخالات في جدول items
        $totalEntries = $itemModel->countAllResults();

        // 4. الأصناف منخفضة المخزون
        $lowStock = $itemOrderModel->where('quantity <', 10)
            ->where('quantity >', 0)
            ->countAllResults();
---
SELECT SUM(`quantity`) AS `quantity`
FROM `item_order`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `item_order`
SELECT COUNT(*) AS `numrows`
FROM `items`
SELECT COUNT(*) AS `numrows`
FROM `item_order`
WHERE `quantity` < 10
AND `quantity` > 0

        $topCategory = $topCategoryResult ? $topCategoryResult->name : 'غير محدد';

        // 6. آخر عملية إضافة
        $lastEntry = $itemOrderModel->select('item_order.created_at, items.name')
            ->join('items', 'items.id = item_order.item_id', 'left')
            ->orderBy('item_order.created_at', 'DESC')
            ->first();
---
SELECT `item_order`.`created_at`, `items`.`name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
ORDER BY `item_order`.`created_at` DESC
 LIMIT 1