app/Controllers/warehouse.php

public function index()
{
    $itemOrderModel = new \App\Models\ItemOrderModel();


    $itemOrders = $itemOrderModel
        ->distinct()
        ->select(
            'item_order.order_id,
             item_order.created_at,
             item_order.created_by,
             room.code AS room_code,
             employee.name AS created_by_name,
             employee.emp_id AS employee_id,
             employee.emp_ext AS extension'
        )
        ->join('employee', 'employee.emp_id = item_order.created_by', 'left')
        ->join('room', 'room.id = item_order.room_id', 'left')
        ->groupBy('item_order.order_id') // Prevent duplicate rows
        ->orderBy('item_order.created_at', 'DESC')
        ->findAll();

    // Other data
    $minorCategoryModel = new \App\Models\MinorCategoryModel();
    $categories = $minorCategoryModel->select('minor_category.*, major_category.name AS major_category_name')
        ->join('major_category', 'major_category.id = minor_category.major_category_id', 'left')
        ->findAll();
---
SELECT DISTINCT `item_order`.`order_id`, `item_order`.`created_at`, `item_order`.`created_by`, `room`.`code` AS `room_code`, `employee`.`name` AS `created_by_name`, `employee`.`emp_id` AS `employee_id`, `employee`.`emp_ext` AS `extension`
FROM `item_order`
LEFT JOIN `employee` ON `employee`.`emp_id` = `item_order`.`created_by`
LEFT JOIN `room` ON `room`.`id` = `item_order`.`room_id`
GROUP BY `item_order`.`order_id`
ORDER BY `item_order`.`created_at` DESC
SELECT `item_order`.*, `items`.`name` as `item_name`, `minor_category`.`name` as `category_name`, `major_category`.`name` as `major_category_name`, `usage_status`.`usage_status`, `room`.`code` as `room_code`, `employee`.`name` as `created_by_name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
LEFT JOIN `major_category` ON `major_category`.`id` = `minor_category`.`major_category_id`
LEFT JOIN `usage_status` ON `usage_status`.`id` = `item_order`.`usage_status_id`
LEFT JOIN `room` ON `room`.`id` = `item_order`.`room_id`
LEFT JOIN `employee` ON `employee`.`emp_id` = `item_order`.`created_by`
ORDER BY `item_order`.`created_at` DESC
SELECT `minor_category`.*, `major_category`.`name` AS `major_category_name`
FROM `minor_category`
LEFT JOIN `major_category` ON `major_category`.`id` = `minor_category`.`major_category_id`

    $stats = $this->getWarehouseStats();

    $orderStatusModel = new \App\Models\OrderStatusModel();
    $statuses = $orderStatusModel->findAll();

    $usageStatusModel = new \App\Models\UsageStatusModel();
    $usageStatuses = $usageStatusModel->findAll();
---
SELECT *
FROM `order_status`
SELECT *
FROM `usage_status`

    private function getWarehouseStats(): array
    {
        $itemOrderModel = new \App\Models\ItemOrderModel();
        $itemModel = new ItemModel();

        // 1. إجمالي الكميات المستلمة
        $totalQuantityResult = $itemOrderModel->selectSum('quantity')->first();
        $totalReceipts = $totalQuantityResult ? (int)$totalQuantityResult->quantity : 0;

        // 2. عدد الأصناف المتوفرة
        $availableItems = $itemOrderModel->countAllResults();

        // 3. إجمالي الإدخالات في جدول items
        $totalEntries = $itemModel->countAllResults();

        // 4. الأصناف منخفضة المخزون
        $lowStock = $itemOrderModel->where('quantity <', 10)
            ->where('quantity >', 0)
            ->countAllResults();

        // 5. أكثر التصنيفات استخداماً
        $topCategoryResult = $itemOrderModel->select('items.minor_category_id, minor_category.name, COUNT(*) as count')
            ->join('items', 'items.id = item_order.item_id')
            ->join('minor_category', 'minor_category.id = items.minor_category_id', 'left')
            ->groupBy('items.minor_category_id')
            ->orderBy('count', 'DESC')
            ->first();
---
SELECT SUM(`quantity`) AS `quantity`
FROM `item_order`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `item_order`
SELECT COUNT(*) AS `numrows`
FROM `items`
SELECT COUNT(*) AS `numrows`
FROM `item_order`
WHERE `quantity` < 10
AND `quantity` > 0
SELECT `items`.`minor_category_id`, `minor_category`.`name`, COUNT(*) as count
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
GROUP BY `items`.`minor_category_id`
ORDER BY `count` DESC
 LIMIT 1

        $topCategory = $topCategoryResult ? $topCategoryResult->name : 'غير محدد';

        // 6. آخر عملية إضافة
        $lastEntry = $itemOrderModel->select('item_order.created_at, items.name')
            ->join('items', 'items.id = item_order.item_id', 'left')
            ->orderBy('item_order.created_at', 'DESC')
            ->first();
---
SELECT `item_order`.`created_at`, `items`.`name`
FROM `item_order`
LEFT JOIN `items` ON `items`.`id` = `item_order`.`item_id`
ORDER BY `item_order`.`created_at` DESC
 LIMIT 1

    public function getAdvancedStats()
    {
        $itemOrderModel = new \App\Models\ItemOrderModel();

        // توزيع الأصناف حسب التصنيف الفرعي
        $categoryDistribution = $itemOrderModel->select('
                items.minor_category_id,
                minor_category.name as category_name,
                COUNT(*) as count,
                SUM(item_order.quantity) as total_qty
            ')
            ->join('items', 'items.id = item_order.item_id')
            ->join('minor_category', 'minor_category.id = items.minor_category_id', 'left')
            ->groupBy('items.minor_category_id')
            ->orderBy('count', 'DESC')
            ->findAll();
---
SELECT `items`.`minor_category_id`, `minor_category`.`name`, COUNT(*) as count
FROM `item_order`
JOIN `items` ON `items`.`id` = `item_order`.`item_id`
LEFT JOIN `minor_category` ON `minor_category`.`id` = `items`.`minor_category_id`
GROUP BY `items`.`minor_category_id`
ORDER BY `count` DESC
 LIMIT 1