app/Models/RoomModel.php

SELECT `building`.`code` AS `building_code`, `floor`.`code` AS `floor_code`, `section`.`code` AS `section_code`, `room`.`code` AS `room_code`
FROM `room`
JOIN `section` ON `section`.`id` = `room`.`section_id`
JOIN `floor` ON `floor`.`id` = `section`.`floor_id`
JOIN `building` ON `building`.`id` = `floor`.`building_id`
WHERE `room`.`id` = '1'
 LIMIT 1
---
    public function getFullLocationCode($roomId)
    {
        $row = $this->select('
                building.code AS building_code,
                floor.code AS floor_code,
                section.code AS section_code,
                room.code AS room_code
            ')
            ->join('section', 'section.id = room.section_id')
            ->join('floor', 'floor.id = section.floor_id')
            ->join('building', 'building.id = floor.building_id')
            ->where('room.id', $roomId)
            ->first();